/*
  Localizable.strings (Français)
  ClipArc

  Created by Adam Lyu on 2026-01-22.
*/

// MARK: - Common
"app.name" = "ClipArc";
"common.enable" = "Activer";
"common.disable" = "Désactiver";
"common.cancel" = "Annuler";
"common.done" = "Terminé";
"common.save" = "Enregistrer";
"common.delete" = "Supprimer";
"common.copy" = "Copier";
"common.paste" = "Coller";
"common.search" = "Rechercher";
"common.settings" = "Paramètres";
"common.continue" = "Continuer";
"common.skip" = "Ignorer";
"common.skip_for_now" = "Ignorer pour le moment";
"common.edit" = "Modifier";
"common.select_all" = "Tout sélectionner";

// MARK: - Language
"language.system" = "Par défaut du système";

// MARK: - Onboarding Welcome
"onboarding.welcome.title" = "Bienvenue sur ClipArc";
"onboarding.welcome.subtitle" = "Votre gestionnaire de presse-papiers intelligent pour macOS";
"onboarding.welcome.get_started" = "Commencer";

// MARK: - Onboarding Features
"onboarding.feature.history.title" = "Historique du presse-papiers";
"onboarding.feature.history.description" = "Accédez à tout ce que vous avez copié";
"onboarding.feature.search.title" = "Recherche instantanée";
"onboarding.feature.search.description" = "Trouvez n'importe quel clip en quelques secondes";
"onboarding.feature.hotkey.title" = "Raccourci global";
"onboarding.feature.hotkey.description" = "⇧⌘V depuis n'importe où";

// MARK: - Onboarding Permissions
"onboarding.permissions.title" = "Autorisations";
"onboarding.permissions.subtitle" = "ClipArc a besoin de quelques autorisations pour fonctionner correctement";
"onboarding.permissions.accessibility.title" = "Accessibilité";
"onboarding.permissions.accessibility.description" = "Requis pour coller automatiquement";
"onboarding.permissions.launch_at_login.title" = "Lancer à l'ouverture de session";
"onboarding.permissions.launch_at_login.description" = "Démarrer ClipArc automatiquement";

// MARK: - Onboarding Sign In
"onboarding.signin.title" = "Se connecter";
"onboarding.signin.subtitle" = "Connectez-vous avec Apple pour synchroniser entre appareils";
"onboarding.signin.signed_in_as" = "Connecté en tant que";
"onboarding.signin.sign_in_later" = "Vous pouvez vous connecter plus tard dans les Paramètres";

// MARK: - Onboarding Subscription
"onboarding.subscription.title" = "Libérez tout votre potentiel";
"onboarding.subscription.subtitle" = "Ne perdez plus jamais un élément copié";
"onboarding.subscription.subscribe" = "S'abonner";
"onboarding.subscription.start_free_trial" = "Continuer avec la version gratuite";
"onboarding.subscription.free_vs_pro" = "Gratuit : 5 éléments · Pro : Illimité";
"onboarding.subscription.you_are_pro" = "Vous êtes Pro !";
"onboarding.subscription.save_44" = "MEILLEURE OFFRE";
"onboarding.subscription.benefit1" = "Historique du presse-papiers illimité";
"onboarding.subscription.benefit2" = "Enregistrez texte, images et fichiers";
"onboarding.subscription.benefit3" = "Recherche instantanée dans tous les clips";
"onboarding.subscription.benefit4" = "Stockage local privé et sécurisé";

// MARK: - Onboarding Complete
"onboarding.complete.title" = "C'est prêt !";
"onboarding.complete.subtitle" = "ClipArc est prêt à être utilisé";
"onboarding.complete.start_using" = "Commencer à utiliser ClipArc";
"onboarding.complete.tip.open" = "Ouvrir l'historique du presse-papiers";
"onboarding.complete.tip.navigate" = "Naviguer entre les éléments";
"onboarding.complete.tip.paste" = "Coller l'élément sélectionné";
"onboarding.complete.tip.close" = "Fermer le panneau";

// MARK: - Settings
"settings.title" = "Paramètres";
"settings.general" = "Général";
"settings.account" = "Compte";
"settings.subscription" = "Abonnement";
"settings.about" = "À propos";

"settings.history_limit" = "Limite de l'historique";
"settings.items" = "éléments";
"settings.startup" = "Démarrage";
"settings.launch_at_login" = "Lancer à l'ouverture de session";
"settings.show_in_dock" = "Afficher dans le Dock";
"settings.hotkey" = "Raccourci";
"settings.global_hotkey" = "Raccourci global";
"settings.permissions" = "Autorisations";
"settings.granted" = "Accordé";
"settings.language" = "Langue";
"settings.restart_required" = "Redémarrez l'app pour appliquer le changement de langue";
"settings.appearance" = "Apparence";
"settings.appearance.system" = "Système";
"settings.appearance.light" = "Clair";
"settings.appearance.dark" = "Sombre";

"settings.sign_out" = "Se déconnecter";
"settings.sync_description" = "Connectez-vous pour synchroniser vos données entre appareils";
"settings.member_account" = "Compte membre";
"settings.sign_in_description" = "Connectez-vous pour vérifier votre adhésion";
"settings.account_linked" = "Compte lié";
"settings.benefit_membership" = "Vérifier l'adhésion Pro";
"settings.benefit_restore" = "Restaurer facilement les achats";
"settings.benefit_multi_device" = "Même compte sur tous les appareils";
"settings.login_required" = "Connexion requise";
"settings.login_required_message" = "Veuillez d'abord vous connecter avec votre Apple ID pour vous abonner. Allez dans l'onglet Compte pour vous connecter.";
"settings.go_to_account" = "OK";
"settings.accessibility_guide" = "Réglages Système → Confidentialité et sécurité → Accessibilité → Activer ClipArc";

"settings.pro_badge" = "ClipArc Pro";
"settings.lifetime_license" = "Licence à vie";
"settings.renews_on" = "Renouvellement le %@";
"settings.manage_subscription" = "Gérer l'abonnement";
"settings.upgrade_to_pro" = "Passer à Pro";
"settings.upgrade_description" = "Obtenez un historique illimité du presse-papiers et plus";
"settings.restore_purchases" = "Restaurer les achats";

"settings.version" = "Version";
"settings.about_description" = "Un gestionnaire de presse-papiers rapide et simple pour macOS";
"settings.support" = "Assistance";
"settings.privacy" = "Confidentialité";
"settings.terms" = "Conditions";

// MARK: - Clipboard
"clipboard.empty.title" = "Pas encore de clips";
"clipboard.empty.subtitle" = "Copiez quelque chose pour commencer";
"clipboard.search.placeholder" = "Rechercher des clips...";
"clipboard.search.no_results" = "Aucun résultat trouvé";
"clipboard.copied" = "Copié";
"clipboard.pasted" = "Collé";

"clipboard.type.all" = "Tout";
"clipboard.type.frequent" = "Fréquent";
"clipboard.type.text" = "Texte";
"clipboard.type.image" = "Image";
"clipboard.type.file" = "Fichier";
"clipboard.type.link" = "Lien";
"clipboard.delete_selected" = "Supprimer la sélection";

// MARK: - Menu Bar
"menu.show_panel" = "Afficher ClipArc";
"menu.preferences" = "Préférences...";
"menu.clear_history" = "Effacer l'historique";
"menu.about" = "À propos de ClipArc";
"menu.help" = "Aide";
"menu.quit" = "Quitter ClipArc";

// MARK: - Rating
"rating.title" = "Vous aimez ClipArc ?";
"rating.subtitle" = "Vos commentaires nous aident à nous améliorer";
"rating.yes_love_it" = "Oui, j'adore !";
"rating.not_really" = "Pas vraiment";

// MARK: - Errors
"error.generic" = "Une erreur s'est produite. Veuillez réessayer.";
"error.auth_failed" = "L'authentification a échoué. Veuillez réessayer.";
"error.purchase_failed" = "L'achat a échoué. Veuillez réessayer.";
"error.network" = "Erreur réseau. Veuillez vérifier votre connexion.";

// MARK: - Time
"time.just_now" = "À l'instant";
"time.minutes_ago" = "Il y a %d min";
"time.hours_ago" = "Il y a %d h";
"time.yesterday" = "Hier";
"time.days_ago" = "Il y a %d jours";

// MARK: - Toast
"toast.running" = "Fonctionne en arrière-plan";

"settings.storage" = "Stockage";
"settings.cache_size" = "Taille du cache";
"settings.history_items" = "Éléments de l'historique";
"settings.clear_cache" = "Vider le cache";
"settings.clear_cache_message" = "Toutes les images et miniatures en cache seront supprimées. Votre historique du presse-papiers sera conservé.";
"settings.clear_all_history" = "Effacer tout l'historique";
"settings.clear_history_message" = "Tout l'historique du presse-papiers sera définitivement supprimé. Cette action est irréversible.";
"settings.clear" = "Effacer";
